       IDENTIFICATION DIVISION.
       PROGRAM-ID. ZODIA.
       
       DATA DIVISION.
       
       01 BIRTHDATE.
       	02 MMONTH PIC 9(2).
      	02 DDATE PIC 9(2).
      	02 YYEAR PIC 9(4).
       
       PROCEDURE DIVISION.
       ACCEPT BIRTHDATE.
       
       IF MMONTH = 3 AND DDATE >= 21 
       OR MMONTH = 4 AND DDATE <= 19 THEN
       	
       		IF MMONTH = 3 THEN
       		DISPLAY 'YOURE BORN ON MARCH ', DDATE, ' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS ARIES.'
       		
       		ELSE IF MMONTH = 4 THEN
       		DISPLAY 'YOURE BORN ON APRIL ', DDATE,' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS ARIES.'
       		END-IF
       	
       ELSE IF MMONTH = 4 AND DDATE >= 20 
       OR MMONTH = 5 AND DDATE <= 21 THEN
       
       	IF MMONTH = 4 THEN
       		DISPLAY 'YOURE BORN ON APRIL ', DDATE, ' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS TAURUS.'
       	
       	ELSE IF MMONTH = 5 THEN
       		DISPLAY 'YOURE BORN ON MAY ', DDATE,' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS TAURUS.'
       		END-IF
       ELSE IF MMONTH = 5 AND DDATE >= 21 
       OR MMONTH = 6 AND DDATE <= 20 THEN
       
       		IF MMONTH = 5 THEN
       		DISPLAY 'YOURE BORN ON MAY ', DDATE, ' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS GEMINI.'
       	
       		ELSE IF MMONTH = 6 THEN
       		DISPLAY 'YOURE BORN ON JUNE ', DDATE,' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS GEMINI.'
       		END-IF
       ELSE IF MMONTH = 6 AND DDATE >= 21 
       OR MMONTH = 7 AND DDATE <= 22 THEN
       
       		IF MMONTH = 6 THEN
       		DISPLAY 'YOURE BORN ON JUNE ', DDATE, ' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS CANCER.'
       		ELSE IF MMONTH = 7 THEN
       		DISPLAY 'YOURE BORN ON JULY ', DDATE,' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS CANCER.'
       		END-IF
       ELSE IF MMONTH = 7 AND DDATE >= 23 
       OR MMONTH = 8 AND DDATE <= 22 THEN
       
       		IF MMONTH = 7 THEN
       		DISPLAY 'YOURE BORN ON JULY ', DDATE, ' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS LEO.'
       		ELSE IF MMONTH = 8 THEN
       		DISPLAY 'YOURE BORN ON AUGUST ', DDATE,' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS LEO.'
       		END-IF
       ELSE IF MMONTH = 8 AND DDATE >= 23 
       OR MMONTH = 9 AND DDATE <= 22 THEN
       
       		IF MMONTH = 8 THEN
       		DISPLAY 'YOURE BORN ON AUGUST ', DDATE, ' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS VIRGO.'
       		ELSE IF MMONTH = 9 THEN
       		DISPLAY 'YOURE BORN ON SEPTEMBER ', DDATE,' ' YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS VIRGO.'
       		END-IF
       ELSE IF MMONTH = 9 AND DDATE >= 23 
       OR MMONTH = 10 AND DDATE <= 22 THEN
       
       		IF MMONTH = 9 THEN
       		DISPLAY 'YOURE BORN ON SEPTEMBER ', DDATE, ' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS LIBRA.'
       		ELSE IF MMONTH = 10 THEN
       		DISPLAY 'YOURE BORN ON OCTOBER ', DDATE,' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS LIBRA.'
       		END-IF
       ELSE IF MMONTH = 10 AND DDATE >= 23 
       OR MMONTH = 11 AND DDATE <= 21 THEN
       
       		IF MMONTH = 10 THEN
       		DISPLAY 'YOURE BORN ON OCTOBER ', DDATE, ' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS SCORPIO.'
       		ELSE IF MMONTH = 11 THEN
       		DISPLAY 'YOURE BORN ON NOVEMBER ', DDATE,' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS SCORPIO.'
       	 	END-IF
       ELSE IF MMONTH = 11 AND DDATE >= 22 
       OR MMONTH = 12 AND DDATE <= 21 THEN
       
       
       		IF MMONTH = 11 THEN
       		DISPLAY 'YOURE BORN ON NOVEMBER ', DDATE, ' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS SAGITTARIUS.'
       	
       		ELSE IF MMONTH = 12 THEN
       		DISPLAY 'YOURE BORN ON APRIL ', DDATE,' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS SAGITTARIUS.'
       		END-IF
       ELSE IF MMONTH = 12 AND DDATE >= 22 
       OR MMONTH = 1 AND DDATE <= 19 THEN
       
       		IF MMONTH = 12 THEN
       		DISPLAY 'YOURE BORN ON DECEMBER ', DDATE, ' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS CAPRICORN.'
       		ELSE IF MMONTH = 1 THEN
       		DISPLAY 'YOURE BORN ON JANUARY ', DDATE,' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS CAPRICORN.'
       		END-IF
       ELSE IF MMONTH = 1 AND DDATE >= 20 
       OR MMONTH = 2 AND DDATE <= 18 THEN
       
       		IF MMONTH = 1 THEN
       		DISPLAY 'YOURE BORN ON JANUARY ', DDATE, ' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS AQUARIUS.'
       		ELSE IF MMONTH = 2 THEN
       		DISPLAY 'YOURE BORN ON FEBRUARY ', DDATE,' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS AQUARIUS.'
       		END-IF
       ELSE IF MMONTH = 2 AND DDATE >= 19 
       OR MMONTH = 3 AND DDATE <= 20 THEN
       
       		IF MMONTH = 2 THEN
       		DISPLAY 'YOURE BORN ON FEBRUARY ', DDATE, ' ', YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS ARIES.'
       	
       		ELSE IF MMONTH = 3 THEN
       		DISPLAY 'YOURE BORN ON MARCH ', DDATE, ' ',YYEAR
       		DISPLAY 'YOUR ZODIAC SIGN IS ARIES.'
       END-IF.
       STOP RUN.